label intro_text:

    $ dictionary_button = True

    image bg scary_room = "images/bg_scary_room.png"
    scene bg scary_room

    p1 "[[t:вода:вода]] и [[t:камень:камень]] жопа жопа"

    "[[t:я:я]] [[t:сосать:сосать]] [[t:член:член]] [[t:пизда:пизда]]"

    "{font=Homifont.ttf}Ты не понимаешь, что это значит...{font}"

    "Ты слышишь слово: [[t:хлеб:хлеб]] [[t:масло:масло]]"

    "[[t:хлеб:хлеб]] [[t:моча:моча]] "

    "Ты не слышишь слово: "

    "[[t:дура:дура]] — звучит очень глупо, но пока плевать, мы тестируем игру."

    "[[t:Сильваир:Сильваир]] [[t:гей:гей]]"

    "Также сейчас я буду демонстрировать возможности игры."

    "Вот твое время [current_time]."

    "А вот день, когда ты в игре [current_date]"

    "А сейчас фокус!"

    play movie "video/video.webm"
    
    "Видео должно было появиться, но я не знаю, как это сделать."

    return
